lkolbly/cmsis-svd/data/TexasInstruments/LM3S1968.svd
        <register>
          <name>SSCTL3</name>
          <description>ADC Sample Sequence Control 3</description>
          <addressOffset>0x000000A4</addressOffset>
          <fields>
            <field>
              <name>ADC_SSCTL3_D0</name>
              <description>1st Sample Diff Input Select</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL3_END0</name>
              <description>1st Sample is End of Sequence</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL3_IE0</name>
              <description>1st Sample Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ADC_SSCTL3_TS0</name>
              <description>1st Sample Temp Sensor Select</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFIFO3</name>
          <description>ADC Sample Sequence Result FIFO 3</description>
          <addressOffset>0x000000A8</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFIFO3_DATA</name>
              <description>Conversion Result Data</description>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSFSTAT3</name>
          <description>ADC Sample Sequence FIFO 3 Status</description>
          <addressOffset>0x000000AC</addressOffset>
          <fields>
            <field>
              <name>ADC_SSFSTAT3_TPTR</name>
              <description>FIFO Tail Pointer</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT3_HPTR</name>
              <description>FIFO Head Pointer</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT3_EMPTY</name>
              <description>FIFO Empty</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ADC_SSFSTAT3_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMLB</name>
          <description>ADC Test Mode Loopback</description>
          <addressOffset>0x00000100</addressOffset>
          <fields>
            <field>
              <name>ADC_TMLB_LB</name>
              <description>Loopback Mode Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP</name>
      <description>Register map for COMP peripheral</description>
      <groupName>COMP</groupName>
      <prependToName>COMP</prependToName>
      <baseAddress>0x4003C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ACMIS</name>
          <description>Analog Comparator Masked Interrupt Status</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>COMP_ACMIS_IN0</name>
              <description>Comparator 0 Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>COMP_ACMIS_IN1</name>
              <description>Comparator 1 Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>COMP_ACMIS_IN2</name>
              <description>Comparator 2 Masked Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACRIS</name>
          <description>Analog Comparator Raw Interrupt Status</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>COMP_ACRIS_IN0</name>
              <description>Comparator 0 Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>COMP_ACRIS_IN1</name>
              <description>Comparator 1 Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>COMP_ACRIS_IN2</name>
              <description>Comparator 2 Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACINTEN</name>
          <description>Analog Comparator Interrupt Enable</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>COMP_ACINTEN_IN0</name>
              <description>Comparator 0 Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>COMP_ACINTEN_IN1</name>
              <description>Comparator 1 Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>COMP_ACINTEN_IN2</name>
              <description>Comparator 2 Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACREFCTL</name>
          <description>Analog Comparator Reference Voltage Control</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>COMP_ACREFCTL_VREF</name>
              <description>Resistor Ladder Voltage Ref</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>COMP_ACREFCTL_RNG</name>
              <description>Resistor Ladder Range</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>COMP_ACREFCTL_EN</name>
              <description>Resistor Ladder Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACSTAT0</name>
          <description>Analog Comparator Status 0</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>COMP_ACSTAT0_OVAL</name>
              <description>Comparator Output Value</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCTL0</name>
          <description>Analog Comparator Control 0</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>COMP_ACCTL0_CINV</name>
              <description>Comparator Output Invert</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL0_ISEN</name>
              <description>Interrupt Sense</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_LEVEL</name>
                  <description>Level sense, see ISLVAL</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_FALL</name>
                  <description>Falling edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_RISE</name>
                  <description>Rising edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ISEN_BOTH</name>
                  <description>Either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL0_ISLVAL</name>
              <description>Interrupt Sense Level Value</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL0_TSEN</name>
              <description>Trigger Sense</description>
              <bitRange>[6:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL0_TSEN_LEVEL</name>
                  <description>Level sense, see TSLVAL</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_TSEN_FALL</name>
                  <description>Falling edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_TSEN_RISE</name>
                  <description>Rising edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_TSEN_BOTH</name>
                  <description>Either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL0_TSLVAL</name>
              <description>Trigger Sense Level Value</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL0_ASRCP</name>
              <description>Analog Source Positive</description>
              <bitRange>[10:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ASRCP_PIN</name>
                  <description>Pin value of Cn+</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ASRCP_PIN0</name>
                  <description>Pin value of C0+</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL0_ASRCP_REF</name>
                  <description>Internal voltage reference (VIREF)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL0_TOEN</name>
              <description>Trigger Output Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACSTAT1</name>
          <description>Analog Comparator Status 1</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>COMP_ACSTAT1_OVAL</name>
              <description>Comparator Output Value</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCTL1</name>
          <description>Analog Comparator Control 1</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>COMP_ACCTL1_CINV</name>
              <description>Comparator Output Invert</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL1_ISEN</name>
              <description>Interrupt Sense</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ISEN_LEVEL</name>
                  <description>Level sense, see ISLVAL</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ISEN_FALL</name>
                  <description>Falling edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ISEN_RISE</name>
                  <description>Rising edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ISEN_BOTH</name>
                  <description>Either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL1_ISLVAL</name>
              <description>Interrupt Sense Level Value</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL1_TSEN</name>
              <description>Trigger Sense</description>
              <bitRange>[6:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL1_TSEN_LEVEL</name>
                  <description>Level sense, see TSLVAL</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_TSEN_FALL</name>
                  <description>Falling edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_TSEN_RISE</name>
                  <description>Rising edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_TSEN_BOTH</name>
                  <description>Either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL1_TSLVAL</name>
              <description>Trigger Sense Level Value</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL1_ASRCP</name>
              <description>Analog Source Positive</description>
              <bitRange>[10:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ASRCP_PIN</name>
                  <description>Pin value of Cn+</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ASRCP_PIN0</name>
                  <description>Pin value of C0+</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL1_ASRCP_REF</name>
                  <description>Internal voltage reference (VIREF)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL1_TOEN</name>
              <description>Trigger Output Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACSTAT2</name>
          <description>Analog Comparator Status 2</description>
          <addressOffset>0x00000060</addressOffset>
          <fields>
            <field>
              <name>COMP_ACSTAT2_OVAL</name>
              <description>Comparator Output Value</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ACCTL2</name>
          <description>Analog Comparator Control 2</description>
          <addressOffset>0x00000064</addressOffset>
          <fields>
            <field>
              <name>COMP_ACCTL2_CINV</name>
              <description>Comparator Output Invert</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL2_ISEN</name>
              <description>Interrupt Sense</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL2_ISEN_LEVEL</name>
                  <description>Level sense, see ISLVAL</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL2_ISEN_FALL</name>
                  <description>Falling edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL2_ISEN_RISE</name>
                  <description>Rising edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL2_ISEN_BOTH</name>
                  <description>Either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL2_ISLVAL</name>
              <description>Interrupt Sense Level Value</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL2_TSEN</name>
              <description>Trigger Sense</description>
              <bitRange>[6:5]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL2_TSEN_LEVEL</name>
                  <description>Level sense, see TSLVAL</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL2_TSEN_FALL</name>
                  <description>Falling edge</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL2_TSEN_RISE</name>
                  <description>Rising edge</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL2_TSEN_BOTH</name>
                  <description>Either edge</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL2_TSLVAL</name>
              <description>Trigger Sense Level Value</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>COMP_ACCTL2_ASRCP</name>
              <description>Analog Source Positive</description>
              <bitRange>[10:9]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMP_ACCTL2_ASRCP_PIN</name>
                  <description>Pin value of Cn+</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL2_ASRCP_PIN0</name>
                  <description>Pin value of C0+</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP_ACCTL2_ASRCP_REF</name>
                  <description>Internal voltage reference (VIREF)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP_ACCTL2_TOEN</name>
              <description>Trigger Output Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
